ERP.belugaerp/src/Catalogs/бг_creatio_НастройкиОбмена/бг_creatio_НастройкиОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бг_creatio_НастройкиОбмена</name>
  <attributes>
    <name>URIПространстваИмен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресВебСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборВидыЦен</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборЗаказы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборСклады</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборТоварныеКатегорииНМК</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборТоварныеКатегорииСКЮ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеЗаполненияДоговоров</name>
    <attributes>
      <name>ВариантОплаты</name>
      <type>
        <types>EnumRef.бг_ВариантыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОплатыУдалить</name>
      <type>
        <types>EnumRef.ФормыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦен</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоАлкогольнаяПродажа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеЗаполненияЛицензий</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Лицензия</name>
      <type>
        <types>CatalogRef.ЛицензииПоставщиковАлкогольнойПродукции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеЗаполненияПунктовНазначения</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктНазначения</name>
      <type>
        <types>CatalogRef.битПунктыНазначения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИдентификаторыТиповДанныхУПП</name>
    <attributes>
      <name>СтроковоеПредставлениеТипаУПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипМетаданных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>CatalogRef.ЛицензииПоставщиковАлкогольнойПродукции</types>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.битПунктыНазначения</types>
        <types>EnumRef.ФормыОплаты</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.ВидыЦен</types>
        <types>CatalogRef.бг_ЕК_Бренды_БрендыТМ</types>
        <types>CatalogRef.бг_ЕК_Бренды_БрендыМТ</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.СегментыПартнеров</types>
        <types>CatalogRef.бг_ЕК_СКЮ_Классы</types>
        <types>CatalogRef.ТоварныеКатегории</types>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/бг_creatio_НастройкиОбмена/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьНастройкиОтбораПоУмолчанию();
	
	Если Не Параметры.Ключ.Пустая() Тогда
		
		НастройкиОтбораЗаказы = Объект.Ссылка.ОтборЗаказы.Получить();
		Если ЗначениеЗаполнено(НастройкиОтбораЗаказы) Тогда
			НастройкиЗаказы.ЗагрузитьНастройки(НастройкиОтбораЗаказы);
		КонецЕсли;
		
		НастройкиОтбораТоварныеКатегорииСКЮ = Объект.Ссылка.ОтборТоварныеКатегорииСКЮ.Получить();
		Если ЗначениеЗаполнено(НастройкиОтбораТоварныеКатегорииСКЮ) Тогда
			НастройкиТоварныеКатегорииСКЮ.ЗагрузитьНастройки(НастройкиОтбораТоварныеКатегорииСКЮ);
		КонецЕсли;
		
		НастройкиОтбораТоварныеКатегорииНМК = Объект.Ссылка.ОтборТоварныеКатегорииСКЮ.Получить();
		Если ЗначениеЗаполнено(НастройкиОтбораТоварныеКатегорииНМК) Тогда
			НастройкиТоварныеКатегорииНМК.ЗагрузитьНастройки(НастройкиОтбораТоварныеКатегорииНМК);
		КонецЕсли;
		
		НастройкиОтбораВидыЦен = Объект.Ссылка.ОтборВидыЦен.Получить();
		Если ЗначениеЗаполнено(НастройкиОтбораВидыЦен) Тогда
			НастройкиВидыЦен.ЗагрузитьНастройки(НастройкиОтбораВидыЦен);
		КонецЕсли;
		
		НастройкиОтбораСклады = Объект.Ссылка.ОтборСклады.Получить();
		Если ЗначениеЗаполнено(НастройкиОтбораСклады) Тогда
			НастройкиСклады.ЗагрузитьНастройки(НастройкиОтбораСклады);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНастройкиОтбораПоУмолчанию()
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	// Настройки контрагенты
	СхемаКомпоновкиДанных = СправочникОбъект.ПолучитьМакет("ШаблонЗаказы");
	ВремХранилищеСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
	НастройкиЗаказы.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ВремХранилищеСКД));
	НастройкиЗаказы.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	НастройкиЗаказы.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	Содержимое = СправочникОбъект.ОтборЗаказы.Получить();
	
	Если Содержимое <> Неопределено Тогда
		НастройкиЗаказы.ЗагрузитьНастройки(Содержимое);
	КонецЕсли;
	
	// Настройки номенклатура СКЮ
	СхемаКомпоновкиДанных = СправочникОбъект.ПолучитьМакет("ШаблонТоварныеКатегорииСКЮ");
	ВремХранилищеСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
	НастройкиТоварныеКатегорииСКЮ.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ВремХранилищеСКД));
	НастройкиТоварныеКатегорииСКЮ.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	НастройкиТоварныеКатегорииСКЮ.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	Содержимое = СправочникОбъект.ОтборТоварныеКатегорииСКЮ.Получить();
	
	Если Содержимое <> Неопределено Тогда
		НастройкиТоварныеКатегорииСКЮ.ЗагрузитьНастройки(Содержимое);
	КонецЕсли;
	
	// Настройки номенклатура НМК
	СхемаКомпоновкиДанных = СправочникОбъект.ПолучитьМакет("ШаблонТоварныеКатегорииНМК");
	ВремХранилищеСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
	НастройкиТоварныеКатегорииНМК.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ВремХранилищеСКД));
	НастройкиТоварныеКатегорииНМК.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	НастройкиТоварныеКатегорииНМК.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	Содержимое = СправочникОбъект.ОтборТоварныеКатегорииСКЮ.Получить();
	
	Если Содержимое <> Неопределено Тогда
		НастройкиТоварныеКатегорииНМК.ЗагрузитьНастройки(Содержимое);
	КонецЕсли;
	
	// Настройки виды цен
	СхемаКомпоновкиДанных = СправочникОбъект.ПолучитьМакет("ШаблонВидыЦен");
	ВремХранилищеСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
	НастройкиВидыЦен.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ВремХранилищеСКД));
	НастройкиВидыЦен.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	НастройкиВидыЦен.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	Содержимое = СправочникОбъект.ОтборВидыЦен.Получить();
	
	Если Содержимое <> Неопределено Тогда
		НастройкиВидыЦен.ЗагрузитьНастройки(Содержимое);
	КонецЕсли;
	
	// Настройки склады
	СхемаКомпоновкиДанных = СправочникОбъект.ПолучитьМакет("ШаблонСклады");
	ВремХранилищеСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
	НастройкиСклады.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ВремХранилищеСКД));
	НастройкиСклады.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	НастройкиСклады.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	Содержимое = СправочникОбъект.ОтборСклады.Получить();
	
	Если Содержимое <> Неопределено Тогда
		НастройкиСклады.ЗагрузитьНастройки(Содержимое);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОтборЗаказы = Новый ХранилищеЗначения(НастройкиЗаказы.ПолучитьНастройки());
	ТекущийОбъект.ОтборТоварныеКатегорииСКЮ = Новый ХранилищеЗначения(НастройкиТоварныеКатегорииСКЮ.ПолучитьНастройки());
	ТекущийОбъект.ОтборТоварныеКатегорииНМК = Новый ХранилищеЗначения(НастройкиТоварныеКатегорииНМК.ПолучитьНастройки());
	ТекущийОбъект.ОтборВидыЦен = Новый ХранилищеЗначения(НастройкиВидыЦен.ПолучитьНастройки());
	ТекущийОбъект.ОтборСклады = Новый ХранилищеЗначения(НастройкиСклады.ПолучитьНастройки());
	
КонецПроцедуры

#КонецОбласти
